# ================================
#دانشجو:Fatemeh Azizi 
#شماره دانشجویی: 404130993
#عنوان پروژه:شبیه ساز جام جهانی 2026
#تاریخ تحویل:1405/05/04
# ================================

import random

def poisson_simple(lam):
    """
    شبیه‌سازی تعداد گل با توزیع پواسون به روش تجمعی (بدون numpy).

    Args:
        lam (float): میانگین تعداد گل مورد انتظار برای یک تیم

    Returns:
        int: تعداد گل شبیه‌سازی شده (عددی صحیح)
    """
    if lam <= 0.5:
        prob = [0.6, 0.3, 0.1, 0.0, 0.0]
    elif lam <= 1.0:
        prob = [0.37, 0.37, 0.18, 0.06, 0.02]
    elif lam <= 1.5:
        prob = [0.22, 0.33, 0.25, 0.12, 0.05, 0.02, 0.01]
    elif lam <= 2.0:
        prob = [0.14, 0.27, 0.27, 0.18, 0.09, 0.04, 0.01]
    else:
        prob = [0.08, 0.18, 0.27, 0.22, 0.14, 0.07, 0.03, 0.01]

    return random.choices(range(len(prob)), weights=prob)[0]